---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FormFailures.OpenProfileMultiSegmentSweepsNotSupported
source: html/d26cf19a-7f29-d936-6c63-de8abdeb033b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FormFailures.OpenProfileMultiSegmentSweepsNotSupported Property

An open profile cannot be swept along a multi-segment path.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpenProfileMultiSegmentSweepsNotSupported { get; }
```